; domain
(define (domain BLOCKS)
  (:requirements :strips :typing)
  (:types block position)
  (:predicates (on ?x - block ?y - block)
	       (ontable ?x - block)
	       (clear ?x - block)
	       (handempty)
	       (holding ?x - block)
		   (at ?x - block ?p - position)
           (free ?p - position)
	       )
	     
  (:action pick-up
	     :parameters (?x - block)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)))

  (:action put-down
	     :parameters (?x - block)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action stack
	     :parameters (?x - block ?y - block)
	     :precondition (and (holding ?x) (clear ?y))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x - block ?y - block)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y))))
		   
  (:action place
	     :parameters (?x - block ?p - position)
	     :precondition (and (holding ?x) (free ?p))
	     :effect
	     (and (not (holding ?x))
		   (not (free ?p))
		   (clear ?x)
		   (handempty)
		   (at ?x ?p)))
		   
  (:action pick-from-pos
	     :parameters (?x - block ?p - position)
	     :precondition (and (clear ?x) (at ?x ?p) (handempty))
	     :effect
	     (and (not (at ?x ?p))
		   (not (clear ?x))
		   (not (handempty))
		   (free ?p)
		   (holding ?x)))		   
		   
		   )

; problem
(define (problem dobot01)
(:domain BLOCKS)
(:objects cube_yellow_0 cube_blue_0 cube_red_0 - block
posred posblue posyellow - position)
(:init (HANDEMPTY) (free posred)(free posblue)(free posyellow)(ontable cube_yellow_0)(ontable cube_blue_0)(ontable cube_red_0)(clear cube_yellow_0)(clear cube_blue_0)(clear cube_red_0))
(:goal (and (at cube_yellow_0 posyellow)(at cube_blue_0 posblue)(at cube_red_0 posred)(clear cube_yellow_0)(clear cube_blue_0)(clear cube_red_0)))
)

; plan
1. (pick-up cube_yellow_0)
   deleted: (ontable cube_yellow_0) (clear cube_yellow_0) (handempty)
   added: (holding cube_yellow_0)
   goals met: 2 of 6
2. (place cube_yellow_0 posyellow)
   deleted: (holding cube_yellow_0) (free posyellow)
   added: (clear cube_yellow_0) (handempty) (at cube_yellow_0 posyellow)
   goals met: 4 of 6
3. (pick-up cube_blue_0)
   deleted: (ontable cube_blue_0) (clear cube_blue_0) (handempty)
   added: (holding cube_blue_0)
   goals met: 3 of 6
4. (place cube_blue_0 posblue)
   deleted: (holding cube_blue_0) (free posblue)
   added: (clear cube_blue_0) (handempty) (at cube_blue_0 posblue)
   goals met: 5 of 6
5. (pick-up cube_red_0)
   deleted: (ontable cube_red_0) (clear cube_red_0) (handempty)
   added: (holding cube_red_0)
   goals met: 4 of 6
6. (place cube_red_0 posred)
   deleted: (holding cube_red_0) (free posred)
   added: (clear cube_red_0) (handempty) (at cube_red_0 posred)
   goals met: 6 of 6
